Repository: Krishitha03/TechM_Training_Tasks
Catalog: Flutter_Tasks/smart_napper/lib/l10n/app_*.arb
Languages: es, ta

# app_title
source: Smart Napper
es: Siesta Inteligente
ta: ஸ்மார்ட் தூக்கம்

source: Change Language
es: Cambiar idioma
ta: மொழியை மாற்று

source: Select Nap Duration:
es: Seleccionar duración de la siesta:
ta: தூக்க நேரத்தை தேர்ந்தெடு:

source: Start Nap
es: Iniciar siesta
ta: தூக்கம் தொடங்கு

source: Wake Up!
es: ¡Despierta!
ta: எழுந்திரு!

# nap_time_up
source: Your nap time is up!
es: ¡Tu tiempo de siesta ha terminado!
ta: உங்கள் தூக்க நேரம் முடிந்துவிட்டது!

source: OK
ta: சரி

source: Wake-Up Time:
es: Hora de despertar:
ta: எழும்பும் நேரம்:

# no_naps_recorded
source: No naps recorded yet.
es: No hay siestas registradas.
ta: எந்த தூக்கமும் பதிவாகவில்லை.

source: Nap Tips
es: Consejos para la siesta
ta: தூக்க குறிப்புகள்

# tip_1
source: Keep naps between 10-20 minutes for best benefits.
es: Mantén las siestas entre 10-20 minutos para mejores beneficios.
ta: சிறந்த நன்மைகளுக்கு 10-20 நிமிட தூக்கம் போதுமானது.

# tip_2
source: Avoid napping after 3 PM to maintain a good sleep cycle.
es: Evita dormir la siesta después de las 3 PM para mantener un buen ciclo de sueño.
ta: நல்ல உறக்க சூழலைப் பேண 3 PMக்குப் பிறகு தூங்குவதை தவிர்க்கவும்.

# tip_3
source: Use a quiet, dark space for better relaxation.
es: Usa un espacio tranquilo y oscuro para una mejor relajación.
ta: நீண்ட தூக்கத்திற்குப் பதிலாக சிறிய நேர தூக்கத்தை தேர்வு செய்யவும்.

# tip_4
source: Try using white noise to fall asleep faster.
es: Prueba usar ruido blanco para dormir más rápido.
ta: வெள்ளை ஒலி பயன்படுத்துவதால் விரைவில் உறக்கமடையலாம்.

# tip_5
source: Set an alarm to avoid oversleeping.
es: Configura una alarma para evitar dormir demasiado.
ta: அதிக நேரம் உறக்கமடையாமல் இருக்க அலாரம் அமைக்கவும்.

source: Nap History
es: Historial de siestas
ta: தூக்க வரலாறு

source: Nap Duration:
es: Duración de la siesta:
ta: தூக்க காலம்:

source: minutes
es: minutos
ta: நிமிடங்கள்

# wake_up_alert
source: Wake Up!
es: ¡Despierta!
ta: எழுந்திரு!

# wake_up_message
source: Your nap time is up!
es: ¡Tu tiempo de siesta ha terminado!
ta: உங்கள் தூக்க நேரம் முடிந்துவிட்டது!

source: Nap Started
es: Siesta iniciada
ta: தூக்கம் தொடங்கியது

source: Reset
es: Reiniciar
ta: மீளமை

# wake_up_time_up
source: Wake-up time is up!
es: ¡Hora de despertar!
ta: எழும்பும் நேரம் முடிந்துவிட்டது!

source: Off
es: Apagar
ta: நிறுத்து
